caoguanqiu/tuya_ble_sdk_Demo_Project_nrf52832/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    //static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    //static uint8_t index = 0;
    uint8_t rx_char=0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:
        UNUSED_VARIABLE(app_uart_get(&rx_char));
        //UNUSED_VARIABLE(app_uart_get(&data_array[index]));
        // index++;
        tuya_ble_common_uart_receive_data(&rx_char,1);
        break;

    case APP_UART_COMMUNICATION_ERROR:
        // APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        //APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}
/**@snippet [Handling the data received over UART] */


uint32_t ble_nus_send_mtu(const uint8_t * data, uint16_t length)
{
    uint32_t       err_code;
    do
    {
        err_code = ble_nus_commdata_send(&m_nus_commdata, (uint8_t *)data, &length, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND) &&
                (err_code != NRF_SUCCESS))
        {
            NRF_LOG_ERROR("ble nus send mtu error,err_code = %d\n",err_code);
            APP_ERROR_CHECK(err_code);
        }
    } while (err_code == NRF_ERROR_RESOURCES);
}


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_9600
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


void update_adv_data(uint8_t const* p_ad_data, uint8_t ad_len)
{
    ret_code_t ret;

    ble_gap_adv_data_t     adv_data;

    //sd_ble_gap_adv_stop(m_advertising.adv_handle);
    sd_ble_gap_adv_set_configure(&m_advertising.adv_handle,NULL,NULL);

    memcpy(&adv_data,&m_advertising.adv_data,sizeof(ble_gap_adv_data_t));

    memcpy(adv_data.adv_data.p_data,p_ad_data,ad_len);

    adv_data.adv_data.len = ad_len;

    ret = ble_advertising_advdata_update(&m_advertising,&adv_data,true);

    NRF_LOG_DEBUG("update_adv_data result code =%d\n",ret);
}


void update_scan_rsp_data(uint8_t const *p_sr_data, uint8_t sr_len)
{
    ret_code_t ret;

    ble_gap_adv_data_t     adv_data;

    //sd_ble_gap_adv_stop(m_advertising.adv_handle);
    sd_ble_gap_adv_set_configure(&m_advertising.adv_handle,NULL,NULL);

    memcpy(&adv_data,&m_advertising.adv_data,sizeof(ble_gap_adv_data_t));

    memcpy(adv_data.scan_rsp_data.p_data,p_sr_data,sr_len);

    adv_data.scan_rsp_data.len = sr_len;

    ret = ble_advertising_advdata_update(&m_advertising,&adv_data,true);

    NRF_LOG_DEBUG("update_scan_rsp_data result code =%d\n",ret);
}


/**@brief Function for initializing the Advertising functionality.
 */
#if (TUYA_BLE_PROTOCOL_VERSION_HIGN==3)
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;
    uint8_t buf[22];
    uint8_t service_data[9];

    memset(buf,0,sizeof(buf));

    memset(&init, 0, sizeof(init));

    //init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;//BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    //init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    //init.advdata.uuids_complete.p_uuids  = m_adv_uuids;
    init.advdata.uuids_more_available.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_more_available.p_uuids  = m_adv_uuids;

    ble_advdata_service_data_t service_data_array;
    service_data_array.service_uuid = 0xA201;
    service_data_array.data.p_data = service_data;
    service_data_array.data.size = 9;

    init.advdata.p_service_data_array = &service_data_array;
    init.advdata.service_data_count = 1;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    //scanrsp

    init.srdata.name_type          = BLE_ADVDATA_FULL_NAME;

    ble_advdata_t          scanrsp;
    memset(&scanrsp, 0, sizeof(scanrsp));
    ble_advdata_manuf_data_t p_vendor_data;

    p_vendor_data.company_identifier = 0x07D0;

    p_vendor_data.data.size = 22;

    p_vendor_data.data.p_data = buf;

    init.srdata.p_manuf_specific_data = &p_vendor_data;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}
#else
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;
    uint8_t encry_device_id[DEVICE_ID_LEN];

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;//BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    //init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    //init.advdata.uuids_complete.p_uuids  = m_adv_uuids;
    init.advdata.uuids_more_available.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_more_available.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    //tuya_aes_device_id_encrypt(tuya_para.pid,PRODUCT_ID_LEN,tuya_para.auth_settings.device_id,DEVICE_ID_LEN,encry_device_id);

    //scanrsp
    ble_advdata_t          scanrsp;
    memset(&scanrsp, 0, sizeof(scanrsp));
    ble_advdata_manuf_data_t p_vendor_data;

    p_vendor_data.company_identifier = 0x0259;

    p_vendor_data.data.size = 24+2;
    uint8_t buf[24+2];
    p_vendor_data.data.p_data = buf;
    p_vendor_data.data.p_data[0] = 0x00;
    p_vendor_data.data.p_data[1] = 0x02;
    //memcpy(p_vendor_data.data.p_data+2,tuya_para.pid,PRODUCT_ID_LEN);
    memset(p_vendor_data.data.p_data+2,0,8);
    memcpy(p_vendor_data.data.p_data+2+8,encry_device_id,16);
    init.srdata.p_manuf_specific_data = &p_vendor_data;


    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

#endif

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

